Public Attributes | List of all members
API_DimBase Struct Reference
Element Manager
Describes the base element for dimensioning. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Base  | base
The base element.
 API_Coord  | loc
Location of the dimension line.
 API_Coord3D  | loc3D
Coordinate of the base point in 3D (see API_Coord3D).
Detailed Description
Describes the base element for dimensioning.